## Q1: In this question you have to scrape data using the filters available on the webpage You have to use the location and salary filter.

You have to scrape data for “Data Scientist” designation for first 10 job results. 

You have to scrape the job-title, job-location, company name, experience required. 

The location filter to be used is “Delhi/NCR”. The salary filter to be used is “3-6” lakhs 
The task will be done as shown in the below steps: 
    
**1. first get the web page https://www.naukri.com/**

**2. Enter “Data Scientist” in “Skill, Designations, and Companies” field.** 

**3. Then click the search button.**

**4. Then apply the location filter and salary filter by checking the respective boxes**

**5. Then scrape the data for the first 10 jobs results you get.**

**6. Finally create a dataframe of the scraped data.**

In [1]:
import selenium
from selenium import webdriver
from selenium.webdriver.common.by import By
import time
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

In [28]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [29]:
#getting the webpage

driver.get("https://www.naukri.com/")

In [30]:
#Entering Data Scientist using class name  

job_title=driver.find_element(By.CLASS_NAME,"suggestor-input ")
job_title.send_keys("Data Scientist")

In [31]:
#Clicking search button using class name

search_button = driver.find_element(By.CLASS_NAME,"qsbSubmit")
search_button.click()

In [32]:
#filtering location with XPATH

location_filter=driver.find_element(By.XPATH,"/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[4]/div[2]/div[2]/label/i")
location_filter.click()

In [33]:
#filtering salary with XPATH

salary_filter=driver.find_element(By.XPATH,"/html/body/div/div/main/div[1]/div[1]/div/div/div[2]/div[4]/div[2]/div[2]/label/i")
salary_filter.click()

In [60]:
#Assigning empty lists to store job information

job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [61]:
#For job_title(using XPATH)

title_tags=driver.find_elements(By.XPATH,'//div[@class="cust-job-tuple layout-wrapper lay-2 sjw__tuple "]/div/a')
for i in title_tags:
    title=i.text
    job_title.append(title)

In [62]:
#to scrap first 10 datas

job_title=job_title[:10]

In [63]:
#length for job_title

len(job_title)

10

In [64]:
#scraped first 10 job_title

job_title

['Data Scientist',
 'Senior Data Scientist/ Data Scientist',
 'Data Scientist',
 'Python Data Scientist',
 'Associate Data Scientist',
 'Associate Data Scientist',
 'Lead Data Scientist',
 'Data Scientist',
 'Lead Customer Success - Data Scientist',
 'Data Scientist']

In [65]:
#For job_location(using XPATH)

location_tags=driver.find_elements(By.XPATH,'//span[@class="locWdth"]')
for i in location_tags:
    location=i.text
    job_location.append(location)

In [66]:
#to scrap first 10 datas

job_location=job_location[:10]

In [67]:
#length for job_location


len(job_location)

10

In [68]:
#scraped first 10 job_location


job_location

['Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru',
 'Mumbai, Pune, Chennai, Gurugram, Bengaluru',
 'Gurugram, Bengaluru',
 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru',
 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru',
 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru',
 'Kolkata, Mumbai, New Delhi, Hyderabad/Secunderabad, Pune, Chennai, Bangalore/Bengaluru',
 'Kolkata, Mumbai, New Delhi, Hyderabad, Pune, Chennai, Bengaluru',
 'Pune, Gurugram',
 'Noida']

In [69]:
#For company_name(using XPATH)

company_tags=driver.find_elements(By.XPATH,'//div[@class=" row2"]/span/a[1]')
for i in company_tags:
    company=i.text
    company_name.append(company)

In [70]:
#to scrap first 10 datas

company_name=company_name[:10]

In [71]:
#length forcompany_name

len(company_name)

10

In [72]:
#scraped first 10 company_name

company_name

['Scienaptic Systems',
 'Neal Analytics',
 'Blackbuck',
 'Wizaltia Hr Solutions',
 'Kmart',
 'KAS Services',
 'Elitefit.ai',
 'Fort Technologies',
 'ZS Associates',
 'Times Internet']

In [73]:
#For experience_required(using XPATH)

experience_tags=driver.find_elements(By.XPATH,'//span[@class="expwdth"]')
for i in experience_tags:
    experience=i.text
    experience_required.append(experience)

In [74]:
#to scrap first 10 datas

experience_required=experience_required[:10]

In [75]:
#length for experience_required

len(experience_required)

10

In [76]:
#scraped first 10 experience_required

experience_required

['2-7 Yrs',
 '3-7 Yrs',
 '3-7 Yrs',
 '2-7 Yrs',
 '1-2 Yrs',
 '1-2 Yrs',
 '3-7 Yrs',
 '1-3 Yrs',
 '2-4 Yrs',
 '3-8 Yrs']

In [77]:
#Data Frame for first 10 "Data Scientists" jobs in Delhi/NCR for “3-6” lakhs 

df_data_scientists=pd.DataFrame({"Job_title":job_title,"Job_location":job_location,"Company_name":company_name,"Experience_required":experience_required})

In [78]:
df_data_scientists

,Job_title,Job_location,Company_name,Experience_required
0,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Scienaptic Systems,2-7 Yrs
1,Senior Data Scientist/ Data Scientist,"Mumbai, Pune, Chennai, Gurugram, Bengaluru",Neal Analytics,3-7 Yrs
2,Data Scientist,"Gurugram, Bengaluru",Blackbuck,3-7 Yrs
3,Python Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Wizaltia Hr Solutions,2-7 Yrs
4,Associate Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Kmart,1-2 Yrs
5,Associate Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",KAS Services,1-2 Yrs
6,Lead Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad/Secunder...",Elitefit.ai,3-7 Yrs
7,Data Scientist,"Kolkata, Mumbai, New Delhi, Hyderabad, Pune, C...",Fort Technologies,1-3 Yrs
8,Lead Customer Success - Data Scientist,"Pune, Gurugram",ZS Associates,2-4 Yrs
9,Data Scientist,Noida,Times Internet,3-8 Yrs

### Q2: Write a python program to scrape data for “Data Scientist” Job position in “Bangalore” location. You have to scrape the  job-title, job-location, company_name, experience_required. You have to scrape first 10 jobs data.

This task will be done in following steps:
    
**1. First get the webpage https://www.shine.com/**
    
**2. Enter “Data Analyst” in “Job title, Skills” field and enter “Bangalore” in “enter the location” field.**

**3. Then click the searchbutton.** 

**4. Then scrape the data for the first 10 jobs results you get.**

**5. Finally create a dataframe of the scraped data.**

In [2]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [3]:
#getting the webpage

driver.get("https://www.shine.com/")

In [6]:
#Entering Data Scientist using class name  

job_title=driver.find_element(By.CLASS_NAME,"form-control  ")
job_title.send_keys("Data Scientist")

In [7]:
#Entering Bangalore using XPATH  

job_location=driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[1]/ul/li[2]/div/input')
job_location.send_keys("Bangalore")

In [9]:
#Clicking search button using XPATH

search_button = driver.find_element(By.XPATH,'/html/body/div/div[4]/div/div[2]/div[2]/div/form/div/div[2]/div/button')
search_button.click()

In [10]:
#Assigning empty lists to store job information           

job_title=[]
job_location=[]
company_name=[]
experience_required=[]

In [11]:
#For job_title(using XPATH)

title_tags=driver.find_elements(By.XPATH,'//strong[@class="jobCard_pReplaceH2__xWmHg"]/a')
for i in title_tags:
    title=i.text
    job_title.append(title)

In [12]:
#to scrap first 10 datas

job_title=job_title[:10]

In [13]:
#length for job_title

len(job_title)

10

In [14]:
#scraped first 10 job_title

job_title

['Data Scientist',
 'Data Scientist Urgent Recruitment',
 'Data Scientist Opening',
 'Data Scientist Recruitment',
 'Data Scientist Vacancy',
 'Hiring For Data Scientist',
 'Data Scientist Opening',
 'Data Scientist Opening',
 'Data Scientist Recruitment',
 'ML Data Scientist']

In [15]:
#For job_location(using XPATH)

location_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_locationIcon__zrWt2"]')
for i in location_tags:
    location=i.text
    job_location.append(location)

In [16]:
#to scrap first 10 datas

job_location=job_location[:10]

In [17]:
#length for job_location


len(job_location)

10

In [26]:
#scraped first 10 job_location


job_location

['Bangalore\n+4',
 'Bangalore\n+13',
 'Bangalore\n+13',
 'Bangalore\n+12',
 'Bangalore\n+13',
 'Bangalore\n+13',
 'Bangalore\n+15',
 'Bangalore\n+15',
 'Bangalore\n+9',
 'Bangalore\n+3']

In [29]:
#cleaning unwanted data after "Bangalore"

extracted_job_location =[ "Bangalore" for _ in job_location]

extracted_job_location

['Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore',
 'Bangalore']

In [30]:
#For company_name(using XPATH)

company_tags=driver.find_elements(By.XPATH,'//div[@class="jobCard_jobCard_cName__mYnow"]/span')
for i in company_tags:
    company=i.text
    company_name.append(company)

In [31]:
#to scrap first 10 datas

company_name=company_name[:10]

In [32]:
#length forcompany_name

len(company_name)

10

In [33]:
#scraped first 10 company_name

company_name

['alike thoughts solutions private li...',
 'divya staffing solution',
 'divya staffing solution',
 'radhika enterprises',
 'divya staffing solution',
 'divya staffing solution',
 'renuka interprises',
 'renuka interprises',
 'radhika enterprises',
 'gujarat facility services hiring fo...']

In [34]:
#For experience_required(using XPATH)

experience_tags=driver.find_elements(By.XPATH,'//div[@class=" jobCard_jobCard_lists_item__YxRkV jobCard_jobIcon__3FB1t"]')
for i in experience_tags:
    experience=i.text
    experience_required.append(experience)

In [35]:
#to scrap first 10 datas

experience_required=experience_required[:10]

In [36]:
#length for experience_required

len(experience_required)

10

In [37]:
#scraped first 10 experience_required

experience_required

['5 to 10 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '0 to 4 Yrs',
 '5 to 8 Yrs']

In [40]:
#Data Frame for first 10 "Data Scientists" jobs in "Bengalore"  

df_data_scientists=pd.DataFrame({"Job_title":job_title,"Job_location":extracted_job_location,"Company_name":company_name,"Experience_required":experience_required})

In [41]:
df_data_scientists

,Job_title,Job_location,Company_name,Experience_required
0,Data Scientist,Bangalore,alike thoughts solutions private li...,5 to 10 Yrs
1,Data Scientist Urgent Recruitment,Bangalore,divya staffing solution,0 to 4 Yrs
2,Data Scientist Opening,Bangalore,divya staffing solution,0 to 4 Yrs
3,Data Scientist Recruitment,Bangalore,radhika enterprises,0 to 4 Yrs
4,Data Scientist Vacancy,Bangalore,divya staffing solution,0 to 4 Yrs
5,Hiring For Data Scientist,Bangalore,divya staffing solution,0 to 4 Yrs
6,Data Scientist Opening,Bangalore,renuka interprises,0 to 4 Yrs
7,Data Scientist Opening,Bangalore,renuka interprises,0 to 4 Yrs
8,Data Scientist Recruitment,Bangalore,radhika enterprises,0 to 4 Yrs
9,ML Data Scientist,Bangalore,gujarat facility services hiring fo...,5 to 8 Yrs

### Q3: Scrape 100 reviews data from flipkart.com for iphone11 phone. You have to go the link: 
https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART


As shown in the above page you have to scrape the tick marked attributes. These are:

**1. Rating**

**2. Review summary**

**3. Full review**

**4. You have to scrape this data for first 100reviews.**

In [115]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [116]:
#getting the webpage    

driver.get('https://www.flipkart.com/apple-iphone-11-black-64-gb/product-reviews/itm4e5041ba101fd?pid=MOBFWQ6BXGJCEYNY&lid=LSTMOBFWQ6BXGJCEYNYZXSHRJ&marketplace=FLIPKART')

In [117]:
#Assigning empty lists to store review information

rating=[]
review_summary=[]
full_review=[]

In [119]:
for page in range(0,10):
    rating_tags=driver.find_elements(By.XPATH,'//div[@class="_3LWZlK _1BLPMq"]') #for rating using(XPATH)
    for i in rating_tags:
        rating.append(i.text)
    review_tags=driver.find_elements(By.XPATH,'//p[@class="_2-N8zT"]')  #for review_summary using(XPATH)
    for i in review_tags:
        review_summary.append(i.text)
    full_tags=driver.find_elements(By.XPATH,'//div[@class="t-ZTKy"]/div/div') #for full_review using(XPATH)
    for i in full_tags:
        full_review.append(i.text)  
    next_button=driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div/div/div[2]/div[13]/div/div/nav/a[11]') #for next_button using(XPATH)
    next_button.click()
    time.sleep(3) #Introduce 3 second delay

In [120]:
#lenth for rating after scrapped from website

len(rating)

110

In [121]:
#lenth for review_summary after scrapped from website


len(review_summary)

110

In [122]:
#lenth for full_review after scrapped from website

len(full_review)

110

In [123]:
#from rating ,scrapping first 100 rating

rating=rating[:100]

In [124]:
len(rating)

100

In [125]:
#from review_summary ,scrapping first 100 review_summary

review_summary=review_summary[:100]

In [126]:
len(review_summary)

100

In [127]:
#from full_review ,scrapping first 100 full_review

full_review=full_review[:100]

In [128]:
len(full_review)

100

In [130]:
#Data frame for reviews of iphone 11 black 64gb 

df_iphone11=pd.DataFrame({'Rating':rating,'Review_summary':review_summary,'Full_review':full_review})

In [131]:
df_iphone11

,Rating,Review_summary,Full_review
0,5,Perfect product!,Photos super
1,5,Classy product,Camera is awesome\nBest battery backup\nA perf...
2,5,Best in the market!,Good Camera
3,5,Worth every penny,Feeling awesome after getting the delivery of ...
4,5,Excellent,NYC
...,...,...,...
95,4,Really Nice,Great phone and camera and timely delivery by ...
96,4,Good quality product,"Awesome camera, smooth and fast UI, display is..."
97,5,Just wow!,Just Wow🥰🤍
98,5,Excellent,Value for money
99,5,Best in the market!,The only thing i didnt like about the phone is...

### Q4: Scrape data for first 100 sneakers you find when you visit flipkart.com and search for “sneakers” in the search field.

You have to scrape 3 attributes of each sneaker:

**1. Brand**

**2. ProductDescription**

**3. Price**

As shown in the below image, you have to scrape the above attributes.

In [132]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [133]:
#getting the webpage

driver.get("https://www.flipkart.com/")

In [134]:
#Entering Sneakers using class name  

sneakers=driver.find_element(By.CLASS_NAME,"Pke_EE")
sneakers.send_keys("sneakers")

In [135]:
#Clicking search button using class name

search_button = driver.find_element(By.CLASS_NAME,"_2iLD__")
search_button.click()

In [136]:
#Assigning empty lists to store product information

brand=[]
product_description=[]
price=[]

In [137]:
for page in range(0,3):
    brand_tags=driver.find_elements(By.XPATH,'//div[@class="_2WkVRV"]') #for brand using(XPATH)
    for i in brand_tags:
        brand.append(i.text)
    product_tags=driver.find_elements(By.XPATH,'//div[@class="_2B099V"]/a[1]')  #for product_description using(XPATH)
    for i in product_tags:
        product_description.append(i.text)
    price_tags=driver.find_elements(By.XPATH,'//div[@class="_30jeq3"]') #for price using(XPATH)
    for i in price_tags:
        price.append(i.text)  
    next_button=driver.find_element(By.XPATH,'/html/body/div/div/div[3]/div[1]/div[2]/div[12]/div/div/nav/a[11]') #for next_button using(XPATH)
    next_button.click()
    time.sleep(3) #Introduce 3 second delay

In [138]:
#lenth for brand after scrapped from website

len(brand)

120

In [139]:
#lenth for product_descriptionafter scrapped from website

len(product_description)

120

In [140]:
#lenth for price after scrapped from website

len(price)

120

In [141]:
#from brand ,scrapping first 100 brand

brand=brand[:100]

len(brand)

100

In [142]:
#from product_description ,scrapping first 100 product_description 

product_description=product_description[:100]

len(product_description)

100

In [143]:
#from price,scrapping first 100 price

price=price[:100]

len(price)

100

In [144]:
#Data frame for first 100 sneakers in "https://www.flipkart.com/" website

df_for_sneakers=pd.DataFrame({"Brand":brand,"Product_description":product_description,"Price":price})

In [145]:
df_for_sneakers

          Brand                                Product_description   Price
0        Kraasa  GROOVY Mid-Top Casual Chunky Streetwear Fashio...    ₹499
1        BRUTON    !Combo Pack Of 2 Casual Shoes! Sneakers For Men    ₹470
2      URBANBOX  Trending Stylish Casual Outdoor Shoes Sneakers...    ₹299
3      RED TAPE  Casual Sneakers Shoes for Men | Soft Cushioned...  ₹1,179
4          aadi  Synthetic Leather |Lightweight|Comfort|Summer|...    ₹323
..          ...                                                ...     ...
95         PUMA                     RS-0 Sound SD Sneakers For Men  ₹3,199
96        asian  Tarzan-06 Gym,Sports,Walking,Stylissh With Ext...    ₹749
97         PUMA                         Glanza v2 Sneakers For Men  ₹1,799
98  New Balance                              2002 Sneakers For Men  ₹7,800
99       BRUTON           Exclusive Sneaker Shoes Sneakers For Men    ₹352

[100 rows x 3 columns]

### Q5: Go to webpage https://www.amazon.in/ Enter “Laptop” in the search field and then click the search icon. Then set CPU Type filter to “Intel Core i7” as shown in the below image:
    
Aftersetting the filters scrape first 10 laptops data. You have to scrape 3 attributes for each laptop:
    
**1. Title**

**2. Ratings**

**3. Price**

In [2]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [3]:
#getting the webpage    

driver.get('https://www.amazon.in/')

In [4]:
#Entering laptop using XPATH 

laptop=driver.find_element(By.XPATH,"/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[2]/div[1]/input")
laptop.send_keys("Laptop")

In [5]:
#Clicking search button using class XPATH

search_button = driver.find_element(By.XPATH,'/html/body/div[1]/header/div/div[1]/div[2]/div/form/div[3]/div')
search_button.click()

In [6]:
#filtering CPU Type filter to "Intel Core i7" with XPATH

cpu_filter=driver.find_element(By.XPATH,"/html/body/div[1]/div[1]/div[1]/div[2]/div/div[3]/span/div[1]/div/div/div[6]/ul[19]/span/span[9]/li/span/a/div/label/i")
cpu_filter.click()

In [25]:
laptop_title=[]
laptop_ratings=[]
laptop_price=[]

In [26]:
#For laptop_title(using XPATH)

title_tags=driver.find_elements(By.XPATH,'//h2[@class="a-size-mini a-spacing-none a-color-base s-line-clamp-2"]')
for i in title_tags:
    title=i.text
    laptop_title.append(title)

In [27]:
len(laptop_title)

24

In [28]:
#to scrap first 10 datas

laptop_title=laptop_title[:10]

In [29]:
laptop_title

['ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144Hz, Intel Core i7-11800H 11th Gen, 4GB NVIDIA GeForce RTX 3050 Ti, Gaming Laptop (16GB/512GB SSD/Windows 11/90WHrs Battery/Black/2.30 Kg), FX506HE-HN382W',
 'MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM FHD 60Hz Laptop (16GB/512GB NVMe SSD/Windows 11 Home/Intel Iris Xe Graphics/Classic Black/1.4Kg), C12M-459IN',
 'ASUS Vivobook 15, Intel Core i7-12650H 12th Gen, 15.6" (39.62 cm) FHD, Thin and Light Laptop (16GB/512GB/Win11/Office 2021/Blue/1.7 kg), X1502ZA-EJ741WS',
 'Lenovo ThinkBook 15 Intel 12th Gen Core i7 15.6" (39.62cm) FHD IPS 300 Nits Antiglare Thin and Light Laptop (16GB/512GB SSD/Windows 11 Home/Backlit/Mineral Grey/1Y Premier Support/1.7 Kg), 21DJA0Y0IN',
 'HP Pavilion 14 12th Gen Intel Core i7 16GB SDRAM/1TB SSD 14 inch(35.6cm) FHD,IPS,Micro-Edge Display/Intel Iris Xe Graphics/B&O/Win 11/Alexa Built-in/Backlit KB/FPR/MSO 2021/Natural Silver,14-dv2015TU',
 'ZEBRONICS Laptop PRO Series Z NBC 5S, Intel Core 12th Gen i7 Processor (16GB RAM | 512GB SSD), 15.6-Inch (39.6 CM) IPS Display, (Ultra Slim | 38.5 Wh Large Battery |Windows 11 |Midnight Blue |1.76 Kg)',
 'ASUS TUF Gaming F15 (2023) 90WHr Battery, Intel Core i7-12700H 12th Gen, 15.6" FHD 144Hz, 8GB RTX 4060, Gaming Laptop (16GB/512GB SSD/Windows 11//1-Zone RGB/Gray/2.20 Kg), FX507ZV-LP094W',
 'Dell G15 5530 Gaming Laptop, Intel i7-13650HX/16GB/1TB SSD/NVIDIA RTX 3050, 6 GB GDDR6/15.6" (39.62cm) FHD AG 120Hz 250 nits/Backlit KB RGB/Dark Shadow Grey/Win 11+MSO\'21/15 Month McAfee/2.65kg',
 'Lenovo IdeaPad Slim 3 Intel Core i7 11th Gen 15.6" (39.62cm) FHD Laptop (16GB/512GB SSD/Win 11/Office 2021/2 Years Warranty/Arctic Grey/1.65Kg), 82H803B6IN',
 'HP Laptop 15s, 12th Gen Intel Core i7-1255U, 15.6-inch (39.6 cm), FHD, 16GB DDR4, 512GB SSD, Intel Iris Xe Graphics, Backlit KB, Thin & Light (Win 11, MSO 2021, Silver, 1.69 kg), fq5190TU']

### I tried more ways to get ratings of the laptop ,it always showing ' ' like this in the output(in following cell)

In [30]:
#For rating(using XPATH)

rating_tags=driver.find_elements(By.XPATH,'//span[@class="a-icon-alt"]')
for i in rating_tags:
    rating=i.text
    laptop_ratings.append(rating)

In [31]:
laptop_ratings

['',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '',
 '']

In [32]:
#For laptop_price(using XPATH)

price_tags=driver.find_elements(By.XPATH,'//span[@class="a-price-whole"]')
for i in price_tags:
    price=i.text
    laptop_price.append(price)

In [33]:
laptop_price

['69,990',
 '49,650',
 '59,990',
 '1,14,590',
 '57,990',
 '76,990',
 '39,990',
 '99,990',
 '99,990',
 '59,400',
 '69,000',
 '1,60,829',
 '68,990',
 '81,990',
 '71,990',
 '82,990',
 '79,990',
 '87,230',
 '90,070',
 '89,990',
 '93,990',
 '87,990',
 '99,990',
 '78,490',
 '95,490']

In [35]:
len(laptop_price)

#in this laptop price there is one unwanted sponsered data so ,removing it

laptop_price.remove('1,14,590')

In [36]:
#after removing unwanted data

len(laptop_price)

24

In [37]:
#to scrap first 10 datas

laptop_price=laptop_price[:10]

In [38]:
#data frame for laptop(title,price) except rating

df_laptop_intel_core_i7=pd.DataFrame({'Laptop_title':laptop_title,'Laptop_price':laptop_price})

In [39]:
df_laptop_intel_core_i7

                                        Laptop_title Laptop_price
0  ASUS TUF Gaming F15, 15.6"(39.62 cms) FHD 144H...       69,990
1  MSI Modern 14, Intel 12th Gen. i7-1255U, 36CM ...       49,650
2  ASUS Vivobook 15, Intel Core i7-12650H 12th Ge...       59,990
3  Lenovo ThinkBook 15 Intel 12th Gen Core i7 15....       57,990
4  HP Pavilion 14 12th Gen Intel Core i7 16GB SDR...       76,990
5  ZEBRONICS Laptop PRO Series Z NBC 5S, Intel Co...       39,990
6  ASUS TUF Gaming F15 (2023) 90WHr Battery, Inte...       99,990
7  Dell G15 5530 Gaming Laptop, Intel i7-13650HX/...       99,990
8  Lenovo IdeaPad Slim 3 Intel Core i7 11th Gen 1...       59,400
9  HP Laptop 15s, 12th Gen Intel Core i7-1255U, 1...       69,000

### Q6: Write a python program to scrape data for Top 1000 Quotes of All Time.

The above task will be done in following steps:

**1. First get the webpage https://www.azquotes.com/**

**2. Click on TopQuote**

**3. Than scrap a)Quote b) Author c) Type Of Quotes**

In [21]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [22]:
#getting the webpage    

driver.get('https://www.azquotes.com/')

In [23]:
#Clicking TopQuote using class XPATH

TopQuote = driver.find_element(By.XPATH,'/html/body/div[1]/div[1]/div[1]/div/div[3]/ul/li[5]/a')
TopQuote.click()

In [25]:
quote=[]
author=[]
types_of_quotes=[]

In [26]:
for page in range(0,10):
    quote_tags=driver.find_elements(By.XPATH,'//a[@class="title"]') #for quote using(XPATH)
    for i in quote_tags:
        quote.append(i.text)
    author_tags=driver.find_elements(By.XPATH,'//div[@class="author"]')  #for author using(XPATH)
    for i in author_tags:
        author.append(i.text)
    types_of_quotes_tags=driver.find_elements(By.XPATH,'//div[@class="tags"]') #for types_of_quotes using(XPATH)
    for i in types_of_quotes_tags:
        types_of_quotes.append(i.text)  
    next_button=driver.find_element(By.XPATH,'/html/body/div[1]/div[2]/div/div/div/div[1]/div/div[3]/li[12]/a') #for next_button using(XPATH)
    next_button.click()
    time.sleep(3)

In [27]:
len(quote) #lenth for quote after scrapped from website

1000

In [28]:
len(author) #lenth for author after scrapped from website

1000

In [29]:
len(types_of_quotes) #lenth for types_of_quotes after scrapped from website

1000

In [32]:
df_top_quotes=pd.DataFrame({"Quote":quote,"Author":author,"Types_of_quotes":types_of_quotes})

In [33]:
df_top_quotes

,Quote,Author,Types_of_quotes
0,The essence of strategy is choosing what not t...,Michael Porter,"Essence, Deep Thought, Transcendentalism"
1,One cannot and must not try to erase the past ...,Golda Meir,"Inspiration, Past, Trying"
2,Patriotism means to stand by the country. It d...,Theodore Roosevelt,"Country, Peace, War"
3,Death is something inevitable. When a man has ...,Nelson Mandela,"Inspirational, Motivational, Death"
4,You have to love a nation that celebrates its ...,Erma Bombeck,"4th Of July, Food, Patriotic"
...,...,...,...
995,Regret for the things we did can be tempered b...,Sydney J. Harris,"Love, Inspirational, Motivational"
996,America... just a nation of two hundred millio...,Hunter S. Thompson,"Gun, Two, Qualms About"
997,For every disciplined effort there is a multip...,Jim Rohn,"Inspirational, Greatness, Best Effort"
998,"The spiritual journey is individual, highly pe...",Ram Dass,"Spiritual, Truth, Yoga"
999,The mind is not a vessel to be filled but a fi...,Plutarch,"Inspirational, Leadership, Education"

## Q7: Write a python program to display list of respected former Prime Ministers of India 
    
**(i.e. Name,Born-Dead, Term of office, Remarks)**

from https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1

scrap the mentioned data and make the DataFrame

In [102]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [103]:
#getting the webpage

driver.get("https://www.jagranjosh.com/general-knowledge/list-of-all-prime-ministers-of-india-1473165149-1")

In [116]:
#Assigning empty lists to store former_prime_minister information

former_prime_ministers=[]

## for former_prime_minister(using XPATH)(Note: i tried to get one by one information(like.,Name,Born-Dead, Term of office, Remarks) but in this website it is not shown so,i tried in different way )

In [117]:
pm_tags=driver.find_elements(By.XPATH,'//td') 
for i in pm_tags:
    pm=i.text.replace('\n','  ')
    former_prime_ministers.append(pm)

In [118]:
former_prime_ministers

['1.',
 'Jawahar Lal Nehru',
 '(1889–1964)',
 '15 August 1947 to 27 May 1964  16 years, 286 days',
 'The first prime minister of India and the longest-serving PM of India, the first to die in office.',
 '2.',
 'Gulzarilal Nanda (Acting)',
 '(1898-1998)',
 '27 May 1964 to 9 June 1964,  13 days',
 'First acting PM of India',
 '3.',
 'Lal Bahadur Shastri',
 '(1904–1966)',
 '9 June 1964 to 11 January 1966  1 year, 216 days',
 "He has given the slogan of 'Jai Jawan Jai Kisan' during the Indo-Pak war of 1965",
 '4. ',
 'Gulzari Lal Nanda  (Acting)',
 '(1898-1998)',
 '11 January 1966 to 24 January 1966  13 days',
 '-',
 '5.',
 'Indira Gandhi',
 '(1917–1984)',
 '24 January 1966 to 24 March 1977  11 years, 59 days',
 'First female Prime Minister of India',
 '6.',
 'Morarji Desai',
 '(1896–1995)',
 '24 March 1977 to  28 July 1979   2 year, 126 days',
 'Oldest to become PM (81 years old) and first to resign from office',
 '7.',
 'Charan Singh',
 '(1902–1987)',
 '28 July 1979 to 14 January 1980  170 days',
 'Only PM who did not face the Parliament',
 '8.',
 'Indira Gandhi',
 '(1917–1984)',
 '14 January 1980 to 31 October 1984  4 years, 291 days',
 'The first lady who served as PM for the second term',
 '9.',
 'Rajiv Gandhi',
 '(1944–1991)',
 '31 October 1984 to 2 December 1989  5 years, 32 days',
 'Youngest to become PM (40 years old)',
 '10.',
 'V. P. Singh',
 '(1931–2008)',
 '2 December 1989 to 10 November 1990  343 days',
 'First PM to step down after a vote of no confidence',
 '11.',
 'Chandra Shekhar',
 '(1927–2007)',
 '10 November 1990 to 21 June 1991  223 days',
 'He belongs to  Samajwadi Janata Party',
 '12.',
 'P. V. Narasimha Rao',
 '(1921–2004)',
 '21 June 1991 to 16 May 1996  4 years, 330 days',
 'First PM from South India',
 '13.',
 'Atal Bihari Vajpayee',
 '(1924- 2018)',
 '16 May 1996 to 1 June 1996  16 days',
 'PM for shortest tenure',
 '14.',
 'H. D. Deve Gowda',
 '(born 1933)',
 '1 June 1996 to 21 April 1997  324 days',
 'He belongs to  Janata Dal',
 '15.',
 'Inder Kumar Gujral',
 '(1919–2012)',
 '21 April 1997 to 19 March 1998   332 days',
 '------',
 '16.',
 'Atal Bihari Vajpayee',
 '(1924-2018)',
 '19 March 1998 to 22 May 2004   6 years, 64 days',
 ' The first non-congress PM who completed a full term as PM',
 '17.',
 'Manmohan Singh',
 '(born 1932)',
 '22 May 2004 to 26 May 2014     10 years, 4 days',
 ' First Sikh PM',
 '18.',
 'Narendra Modi',
 '(born 1950)',
 '26 May 2014 - 2019',
 '4th Prime Minister of India who served two consecutive tenures',
 '19.',
 'Narendra Modi',
 '(born 1950)',
 '30 May 2019- Incumbent',
 'First non-congress PM with two consecutive tenures',
 'List of all Presidents of India',
 'List of Nicknames of Indian Prime Ministers']

In [125]:
#making multiple lists in a list to make dataframe

former_prime_ministers=[['1.',
 'Jawahar Lal Nehru',
 '(1889–1964)',
 '15 August 1947 to 27 May 1964 16 years, 286 days',
 'The first prime minister of India and the longest-serving PM of India, the first to die in office.'],
 ['2.',
 'Gulzarilal Nanda (Acting)',
 '(1898-1998)',
 '27 May 1964 to 9 June 1964,13 days',
 'First acting PM of India'],
 ['3.',
 'Lal Bahadur Shastri',
 '(1904–1966)',
 '9 June 1964 to 11 January 1966 1 year, 216 days',
 "He has given the slogan of 'Jai Jawan Jai Kisan' during the Indo-Pak war of 1965"],
 ['4. ',
 'Gulzari Lal Nanda  (Acting)',
 '(1898-1998)',
 '11 January 1966 to 24 January 1966 13 days',
 '-'],
 ['5.',
 'Indira Gandhi',
 '(1917–1984)',
 '24 January 1966 to 24 March 1977 11 years, 59 days',
 'First female Prime Minister of India'],
 ['6.',
 'Morarji Desai',
 '(1896–1995)',
 '24 March 1977 to  28 July 1979 2 year, 126 days',
 'Oldest to become PM (81 years old) and first to resign from office'],
 ['7.',
 'Charan Singh',
 '(1902–1987)',
 '28 July 1979 to 14 January 1980 170 days',
 'Only PM who did not face the Parliament'],
 ['8.',
 'Indira Gandhi',
 '(1917–1984)',
 '14 January 1980 to 31 October 1984 4 years, 291 days',
 'The first lady who served as PM for the second term'],
 ['9.',
 'Rajiv Gandhi',
 '(1944–1991)',
 '31 October 1984 to 2 December 1989 5 years, 32 days',
 'Youngest to become PM (40 years old)'],
 ['10.',
 'V. P. Singh',
 '(1931–2008)',
 '2 December 1989 to 10 November 1990 343 days',
 'First PM to step down after a vote of no confidence'],
 ['11.',
 'Chandra Shekhar',
 '(1927–2007)',
 '10 November 1990 to 21 June 1991 223 days',
 'He belongs to  Samajwadi Janata Party'],
 ['12.',
 'P. V. Narasimha Rao',
 '(1921–2004)',
 '21 June 1991 to 16 May 1996 4 years, 330 days',
 'First PM from South India'],
 ['13.',
 'Atal Bihari Vajpayee',
 '(1924- 2018)',
 '16 May 1996 to 1 June 1996 16 days',
 'PM for shortest tenure'],
 ['14.',
 'H. D. Deve Gowda',
 '(born 1933)',
 '1 June 1996 to 21 April 1997 324 days',
 'He belongs to  Janata Dal'],
 ['15.',
 'Inder Kumar Gujral',
 '(1919–2012)',
 '21 April 1997 to 19 March 1998 332 days',
 '------'],
 ['16.',
 'Atal Bihari Vajpayee',
 '(1924-2018)',
 '19 March 1998 to 22 May 2004 6 years, 64 days',
 ' The first non-congress PM who completed a full term as PM'],
 ['17.',
 'Manmohan Singh',
 '(born 1932)',
 '22 May 2004 to 26 May 2014  10 years, 4 days',
 ' First Sikh PM'],
 ['18.',
 'Narendra Modi',
 '(born 1950)',
 '26 May 2014 - 2019',
 '4th Prime Minister of India who served two consecutive tenures'],
 ['19.',
 'Narendra Modi',
 '(born 1950)',
 '30 May 2019- Incumbent',
 'First non-congress PM with two consecutive tenures']]

In [126]:
df_former_prime_ministers=pd.DataFrame(former_prime_ministers,columns=['S.N','PM Name','Born-Dead','Terms of office','Remark'])

In [128]:
#Unwanted s.no. , so dropped it

df_former_prime_ministers.drop(columns=['S.N'],inplace=True)

In [130]:
#DataFrame for former prime ministers

df_former_prime_ministers

,PM Name,Born-Dead,Terms of office,Remark
0,Jawahar Lal Nehru,(1889–1964),"15 August 1947 to 27 May 1964 16 years, 286 days",The first prime minister of India and the long...
1,Gulzarilal Nanda (Acting),(1898-1998),"27 May 1964 to 9 June 1964,13 days",First acting PM of India
2,Lal Bahadur Shastri,(1904–1966),"9 June 1964 to 11 January 1966 1 year, 216 days",He has given the slogan of 'Jai Jawan Jai Kisa...
3,Gulzari Lal Nanda (Acting),(1898-1998),11 January 1966 to 24 January 1966 13 days,-
4,Indira Gandhi,(1917–1984),"24 January 1966 to 24 March 1977 11 years, 59 ...",First female Prime Minister of India
5,Morarji Desai,(1896–1995),"24 March 1977 to 28 July 1979 2 year, 126 days",Oldest to become PM (81 years old) and first t...
6,Charan Singh,(1902–1987),28 July 1979 to 14 January 1980 170 days,Only PM who did not face the Parliament
7,Indira Gandhi,(1917–1984),"14 January 1980 to 31 October 1984 4 years, 29...",The first lady who served as PM for the second...
8,Rajiv Gandhi,(1944–1991),"31 October 1984 to 2 December 1989 5 years, 32...",Youngest to become PM (40 years old)
9,V. P. Singh,(1931–2008),2 December 1989 to 10 November 1990 343 days,First PM to step down after a vote of no confi...
10,Chandra Shekhar,(1927–2007),10 November 1990 to 21 June 1991 223 days,He belongs to Samajwadi Janata Party
11,P. V. Narasimha Rao,(1921–2004),"21 June 1991 to 16 May 1996 4 years, 330 days",First PM from South India
12,Atal Bihari Vajpayee,(1924- 2018),16 May 1996 to 1 June 1996 16 days,PM for shortest tenure
13,H. D. Deve Gowda,(born 1933),1 June 1996 to 21 April 1997 324 days,He belongs to Janata Dal
14,Inder Kumar Gujral,(1919–2012),21 April 1997 to 19 March 1998 332 days,------
15,Atal Bihari Vajpayee,(1924-2018),"19 March 1998 to 22 May 2004 6 years, 64 days",The first non-congress PM who completed a ful...
16,Manmohan Singh,(born 1932),"22 May 2004 to 26 May 2014 10 years, 4 days",First Sikh PM
17,Narendra Modi,(born 1950),26 May 2014 - 2019,4th Prime Minister of India who served two con...
18,Narendra Modi,(born 1950),30 May 2019- Incumbent,First non-congress PM with two consecutive ten...

### Q8: Write a python program to display list of 50 Most expensive cars in the world

(i.e. Car name and Price) from https://www.motor1.com/

This task will be done in following steps:

**1. First get the webpage https://www.motor1.com/**

**2. Then You have to type in the search bar ’50 most expensive cars’**

**3. Then click on 50 most expensive carsin the world..**

**4. Then scrap thementioned data and make the dataframe**

In [46]:
#Initializing a chromebrowser using webdriver

driver=webdriver.Chrome()

In [47]:
#getting the webpage

driver.get("https://www.motor1.com/")

In [49]:
#Entering 50 most expensive cars using XPATH  

expensive_car=driver.find_element(By.XPATH,'/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/input')
expensive_car.send_keys("50 most expensive cars")

In [50]:
#Clicking search button using XPATH 

search_button = driver.find_element(By.XPATH ,'/html/body/div[9]/div[2]/div/div/div[3]/div/div/div/form/button[1]')
search_button.click()

In [51]:
#Clicking 50 most expensive cars in the world using XPATH 

most_expensive = driver.find_element(By.XPATH ,'/html/body/div[9]/div[9]/div/div[1]/div/div/div[1]/div/div[1]')
most_expensive.click()

In [60]:
#Assigning empty lists to store car name and price

car_name=[]
car_price=[]

In [61]:
#For car_name(using XPATH)

car_name_tags=driver.find_elements(By.XPATH,'//h3[@class="subheader"]')
for i in car_name_tags:
    name=i.text
    car_name.append(name)

In [62]:
len(car_name)

51

In [63]:
# there is one scrap data from this car_name so limiting the list,

car_name=car_name[:50]

len(car_name)

50

In [64]:
#For car_name(using XPATH)

car_price_tags=driver.find_elements(By.XPATH,'//strong')
for i in car_price_tags:
    price=i.text
    car_price.append(price)

In [66]:
len(car_price)

50

In [69]:
#Data Frame for 50 Most expensive cars in the world

df_50_most_expensive_cars =pd.DataFrame({"Car_name":car_name,"Car_price":car_price})

In [70]:
df_50_most_expensive_cars

                              Car_name                    Car_price
0                  Aston Martin Valour          Price: $1.5 Million
1                         McLaren Elva          Price: $1.7 Million
2                          Czinger 21C          Price: $1.7 Million
3                        Ferrari Monza          Price: $1.7 Million
4                   Gordon Murray T.33          Price: $1.7 Million
5                    Koenigsegg Gemera          Price: $1.7 Million
6                          Zenvo TSR-S          Price: $1.7 Million
7                   Hennessey Venom F5          Price: $1.8 Million
8                      Bentley Bacalar          Price: $1.9 Million
9        Hispano Suiza Carmen Boulogne          Price: $1.9 Million
10              Bentley Mulliner Batur          Price: $2.0 Million
11                        Deus Vayanne          Price: $2.0 Million
12                         SSC Tuatara          Price: $2.0 Million
13                         Lotus Evija          Price: $2.1 Million
14                 Aston Martin Vulcan          Price: $2.3 Million
15                          Delage D12          Price: $2.3 Million
16                 Ferrari Daytona SP3          Price: $2.3 Million
17                   McLaren Speedtail          Price: $2.3 Million
18                        Rimac Nevera          Price: $2.4 Million
19                       Pagani Utopia          Price: $2.5 Million
20                Pininfarina Battista          Price: $2.5 Million
21                  Gordon Murray T.50          Price: $2.6 Million
22                Lamborghini Countach          Price: $2.6 Million
23            Mercedes-AMG Project One          Price: $2.7 Million
24                        Zenvo Aurora          Price: $2.8 Million
25                 Aston Martin Victor          Price: $3.0 Million
26         Hennessey Venom F5 Roadster                 $3.0 Million
27                    Koenigsegg Jesko          Price: $3.0 Million
28               Aston Martin Valkyrie          Price: $3.2 Million
29           W Motors Lykan Hypersport          Price: $3.4 Million
30                       McLaren Solus                 $3.5 Million
31                    Lamborghini Sian          Price: $3.6 million
32                    Koenigsegg CC850          Price: $3.7 Million
33     Bugatti Chiron Super Sport 300+          Price: $3.9 Million
34                  Lamborghini Veneno          Price: $4.5 Million
35                      Bugatti Bolide          Price: $4.7 Million
36           Pininfarina B95 Speedster          Price: $4.8 Million
37                     Bugatti Mistral          Price: $5.0 Million
38                 Pagani Huayra Imola          Price: $5.4 Million
39                        Bugatti Divo          Price: $5.8 Million
40                 SP Automotive Chaos          Price: $6.4 Million
41                    Pagani Codalunga          Price: $7.4 Million
42                        777 Hypercar          Price: $7.5 Million
43            Mercedes-Maybach Exelero          Price: $8.0 Million
44                  Bugatti Centodieci          Price: $9.0 Million
45             Bugatti Chiron Profilée         Price: $10.8 Million
46                Rolls-Royce Sweptail         Price: $12.8 Million
47            Bugatti La Voiture Noire         Price: $13.4 Million
48              Rolls-Royce Boat Tail*  Price: $28.0 Million (est.)
49  Rolls-Royce La Rose Noire Droptail    Price: $30 Million (est.)